
===========================================================================
report_tns
============================================================================
tns -72819.49

===========================================================================
report_wns
============================================================================
wns -31.31

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -31.31

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.08
