
===========================================================================
report_tns
============================================================================
tns -94456.54

===========================================================================
report_wns
============================================================================
wns -41.40

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -41.40

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.08
