
===========================================================================
report_tns
============================================================================
tns -15.84

===========================================================================
report_wns
============================================================================
wns -1.60

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.60

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
