
===========================================================================
report_tns
============================================================================
tns -93663.62

===========================================================================
report_wns
============================================================================
wns -40.68

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -40.68

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.08
