
===========================================================================
report_tns
============================================================================
tns -10.64

===========================================================================
report_wns
============================================================================
wns -1.20

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.20

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.10
