
===========================================================================
report_tns
============================================================================
tns -94020.15

===========================================================================
report_wns
============================================================================
wns -41.03

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -41.03

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.08
