
===========================================================================
report_tns
============================================================================
tns -22.76

===========================================================================
report_wns
============================================================================
wns -1.75

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -1.75

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
