
===========================================================================
report_tns
============================================================================
tns -36.73

===========================================================================
report_wns
============================================================================
wns -2.21

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -2.21

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.11
